In [1]:
import pandas

data={
    'Name':['Ram','Alex','Krish','Salmaan'],
    'Age':[20,30,50,90],
    'City':['Solapur','Guntur','Barely','Nagpur']
}
df4=pandas.DataFrame(data)

In [2]:
df4

      Name  Age     City
0      Ram   20  Solapur
1     Alex   30   Guntur
2    Krish   50   Barely
3  Salmaan   90   Nagpur

In [3]:
df4["Name"]

0        Ram
1       Alex
2      Krish
3    Salmaan
Name: Name, dtype: object

In [4]:
df4[["Name"]]

      Name
0      Ram
1     Alex
2    Krish
3  Salmaan

In [5]:
df4[["Name","Age"]]

      Name  Age
0      Ram   20
1     Alex   30
2    Krish   50
3  Salmaan   90

In [6]:
df4.loc[0]

Name        Ram
Age          20
City    Solapur
Name: 0, dtype: object

In [7]:
df4.loc[0:2]

    Name  Age     City
0    Ram   20  Solapur
1   Alex   30   Guntur
2  Krish   50   Barely

In [8]:
df4.loc[0:2,"Name"]

0      Ram
1     Alex
2    Krish
Name: Name, dtype: object

In [9]:
df4.loc[0:2,["Name"]]

    Name
0    Ram
1   Alex
2  Krish

In [10]:
df4.loc[0,["Name"]]

Name    Ram
Name: 0, dtype: object

In [11]:
df4.loc[0,"Name"]

'Ram'

In [12]:
df4.loc[0]

Name        Ram
Age          20
City    Solapur
Name: 0, dtype: object

In [13]:
df4.loc["Ram"]

KeyError: 'Ram'

In [14]:
df4.loc["Name"]

KeyError: 'Name'

In [15]:
# What is loc?

In [ ]:
'''
1. loc is used access the data.
2. But it will access the data in a DataFrame based on labels.
3. It will access the row in DataFrame.[Ans by Students]
4. You can select row and column by their labels.
5. label-based selection
- It will access based on index labels.
- In Previous example, 0,1,2 are our index.
6. Syntax
df.loc[row_labels,column_labels]

'''

In [16]:
df4

      Name  Age     City
0      Ram   20  Solapur
1     Alex   30   Guntur
2    Krish   50   Barely
3  Salmaan   90   Nagpur

In [17]:
# Row Selection

In [19]:
df4.loc[0]

Name        Ram
Age          20
City    Solapur
Name: 0, dtype: object

In [ ]:
# Multple Row Selection

In [20]:
df4.loc[[0,2,3]]

      Name  Age     City
0      Ram   20  Solapur
2    Krish   50   Barely
3  Salmaan   90   Nagpur

In [21]:
# Column Selection

In [22]:
df=df4.copy()

In [23]:
df

      Name  Age     City
0      Ram   20  Solapur
1     Alex   30   Guntur
2    Krish   50   Barely
3  Salmaan   90   Nagpur

In [24]:
df.loc[2,'Name']

'Krish'

In [25]:
# Select the values at row 2 and column Name.

In [26]:
# Boolean indexing

In [27]:
df.loc[df['Age']>30]

      Name  Age    City
2    Krish   50  Barely
3  Salmaan   90  Nagpur

In [28]:
# Select the rows where codition is true

In [29]:
dfc=df.copy()

In [30]:
dfc

      Name  Age     City
0      Ram   20  Solapur
1     Alex   30   Guntur
2    Krish   50   Barely
3  Salmaan   90   Nagpur

In [31]:
dfc.set_index('Name')

         Age     City
Name
Ram       20  Solapur
Alex      30   Guntur
Krish     50   Barely
Salmaan   90   Nagpur

In [35]:
dfc

      Name  Age     City
0      Ram   20  Solapur
1     Alex   30   Guntur
2    Krish   50   Barely
3  Salmaan   90   Nagpur

In [ ]:
# To make the permanent changes
'''
inplace=True
'''

In [36]:
dfc

      Name  Age     City
0      Ram   20  Solapur
1     Alex   30   Guntur
2    Krish   50   Barely
3  Salmaan   90   Nagpur

In [37]:
dfc.set_index('Name',inplace=True)

In [38]:
dfc

         Age     City
Name
Ram       20  Solapur
Alex      30   Guntur
Krish     50   Barely
Salmaan   90   Nagpur

In [39]:
dfc.loc[0]

KeyError: 0

In [41]:
dfc.loc["Ram"]

Age          20
City    Solapur
Name: Ram, dtype: object

In [42]:
import pandas

data={
    'Name':['Ram','Alex','Krish','Salmaan','Ram'],
    'Age':[20,30,50,90,90],
    'City':['Solapur','Guntur','Barely','Nagpur','UP']
}
df5=pandas.DataFrame(data)

In [43]:
df5

      Name  Age     City
0      Ram   20  Solapur
1     Alex   30   Guntur
2    Krish   50   Barely
3  Salmaan   90   Nagpur
4      Ram   90       UP

In [44]:
df5.set_index('Name',inplace=True)

In [45]:
df5

         Age     City
Name
Ram       20  Solapur
Alex      30   Guntur
Krish     50   Barely
Salmaan   90   Nagpur
Ram       90       UP

In [46]:
df5.loc["Ram"]

      Age     City
Name
Ram    20  Solapur
Ram    90       UP

In [47]:
# inplace=True

In [48]:
'''
1. Instead of returning new copy of the object, inplace=True alters the exisiting object in memory.
'''

'\n1. Instead of returning new copy of the object, inplace=True alters the exisiting object in memory.\n'

In [50]:
df5

         Age     City
Name
Ram       20  Solapur
Alex      30   Guntur
Krish     50   Barely
Salmaan   90   Nagpur
Ram       90       UP

In [51]:
df5.drop(columns='City')

         Age
Name
Ram       20
Alex      30
Krish     50
Salmaan   90
Ram       90

In [52]:
df5

         Age     City
Name
Ram       20  Solapur
Alex      30   Guntur
Krish     50   Barely
Salmaan   90   Nagpur
Ram       90       UP

In [53]:
df5.drop(columns='City',inplace=True)

In [54]:
df5

         Age
Name
Ram       20
Alex      30
Krish     50
Salmaan   90
Ram       90

SyntaxError: invalid non-printable character U+00A0 (979856237.py, line 1)

In [59]:
import pandas as pd

data = {
    'student_id':[101,102,103,104,105],
    'name':['Alex','Krish','Salmaan','Ram','Ganesh'],
    'math_score':[86,22,10,30,41],
    'datascience_score':[86,22,10,30,41]
}
df = pd.DataFrame(data)

In [60]:
df

   student_id     name  math_score  datascience_score
0         101     Alex          86                 86
1         102    Krish          22                 22
2         103  Salmaan          10                 10
3         104      Ram          30                 30
4         105   Ganesh          41                 41

In [61]:
# WAPP to select the rows 102 and 104 using loc

In [62]:
# 20P - Amuthini M

In [63]:
df

   student_id     name  math_score  datascience_score
0         101     Alex          86                 86
1         102    Krish          22                 22
2         103  Salmaan          10                 10
3         104      Ram          30                 30
4         105   Ganesh          41                 41

In [64]:
df.loc[102,104]

KeyError: 104

In [65]:
df.set_index('student_id',inplace=True)

In [66]:
df

               name  math_score  datascience_score
student_id
101            Alex          86                 86
102           Krish          22                 22
103         Salmaan          10                 10
104             Ram          30                 30
105          Ganesh          41                 41

In [68]:
df.loc[102]

name                 Krish
math_score              22
datascience_score       22
Name: 102, dtype: object

In [69]:
df.loc[[102,104]]

             name  math_score  datascience_score
student_id
102         Krish          22                 22
104           Ram          30                 30

In [70]:
df.loc[102,104]

KeyError: 104

In [71]:
df.loc[102]

name                 Krish
math_score              22
datascience_score       22
Name: 102, dtype: object

In [72]:
df.loc[104]

name                 Ram
math_score            30
datascience_score     30
Name: 104, dtype: object

In [73]:
# Data Cleaning & Preprocessing

In [ ]:
'''
1. Identify the missing values.
isna() , isnull()

2. Handle the missing values.
drop(),fillna()

3.Removing the duplicates
drop_duplicates()

4.Data Type conversion.
astype()

'''

In [74]:
# Drop duplicates

In [86]:
data = {
    'A':[1,2,2,3,4],
    'B':[1,6,6,7,7],
}

df=pd.DataFrame(data)
df

   A  B
0  1  1
1  2  6
2  2  6
3  3  7
4  4  7

In [87]:
res=df.drop_duplicates()
res

   A  B
0  1  1
1  2  6
3  3  7
4  4  7

In [92]:
data = {
    'A':[1,2,2,7,7],
    'B':[1,6,6,7,7],
}

df=pd.DataFrame(data)
df

   A  B
0  1  1
1  2  6
2  2  6
3  7  7
4  7  7

In [93]:
res=df.drop_duplicates()
res

   A  B
0  1  1
1  2  6
3  7  7

In [96]:
import pandas as pd

data = {
    'name':['Alex','Bob','Salmaan','Ram','Bob'],
    'Age':[25,30,25,22,30],
}
df = pd.DataFrame(data)

In [97]:
df

      name  Age
0     Alex   25
1      Bob   30
2  Salmaan   25
3      Ram   22
4      Bob   30

In [99]:
ad=df.drop_duplicates()
ad

      name  Age
0     Alex   25
1      Bob   30
2  Salmaan   25
3      Ram   22

In [102]:
# Case 1: Drop duplicates based on all the columns

In [3]:
import pandas as pd

data = {
    'name':['Alex','Bob','Salmaan','Ram','Bob'],
    'Age':[25,30,25,22,30],
}
df = pd.DataFrame(data)

In [4]:
ad=df.drop_duplicates()
ad

      name  Age
0     Alex   25
1      Bob   30
2  Salmaan   25
3      Ram   22

In [103]:
# Case 1: Drop duplicates based on a specific columns

In [105]:
ad=df.drop_duplicates(subset="name")
ad

      name  Age
0     Alex   25
1      Bob   30
2  Salmaan   25
3      Ram   22

In [106]:
# Drop the duplicates based on specific columns and keep the first occurrence

In [107]:
ad=df.drop_duplicates(subset="name",keep="first")
ad

      name  Age
0     Alex   25
1      Bob   30
2  Salmaan   25
3      Ram   22

In [108]:
# Case 1: Drop duplicates based on a multiple columns

In [110]:
ad=df.drop_duplicates(subset=["name","Age"])
ad

      name  Age
0     Alex   25
1      Bob   30
2  Salmaan   25
3      Ram   22
4      Bob   32

In [15]:
import pandas as pd

empdata = {
    'eid':[101,102,103,104,105],
    'name':['Alex','Krish','Salmaan','Ram','Ganesh'],
    'salary':[1000,3000,4000,10000,5000]
}
df = pd.DataFrame(empdata)

In [16]:
df

   eid     name  salary
0  101     Alex    1000
1  102    Krish    3000
2  103  Salmaan    4000
3  104      Ram   10000
4  105   Ganesh    5000

In [9]:
df['salary']

0     1000
1     3000
2     4000
3    10000
4     5000
Name: salary, dtype: int64

In [12]:
df['salary']=df['salary'].astype(float)

In [14]:
df

   eid     name   salary
0  101     Alex   1000.0
1  102    Krish   3000.0
2  103  Salmaan   4000.0
3  104      Ram  10000.0
4  105   Ganesh   5000.0

In [17]:
df['eid']=df['eid'].astype(str)

In [18]:
df

   eid     name  salary
0  101     Alex    1000
1  102    Krish    3000
2  103  Salmaan    4000
3  104      Ram   10000
4  105   Ganesh    5000

In [22]:
df.dtypes

eid       object
name      object
salary     int64
dtype: object

In [23]:
# dtypes is not a function
# It won't accept any attributes

In [24]:
df["eid"].dtype

dtype('O')

In [25]:
# dtype('O') - Object

In [26]:
df["salary"].dtype

dtype('int64')

In [27]:
df['salary']=df['salary'].astype(str)

In [28]:
df.dtypes

eid       object
name      object
salary    object
dtype: object

In [29]:
# str = object

In [30]:
df

   eid     name salary
0  101     Alex   1000
1  102    Krish   3000
2  103  Salmaan   4000
3  104      Ram  10000
4  105   Ganesh   5000

In [31]:
# I need to add the country at last

In [32]:
df["Country"]=["India","Germany","China","Nepal","Australia"]

In [33]:
df

   eid     name salary    Country
0  101     Alex   1000      India
1  102    Krish   3000    Germany
2  103  Salmaan   4000      China
3  104      Ram  10000      Nepal
4  105   Ganesh   5000  Australia

In [34]:
# How to take input to the list,tuple

In [35]:
# I need to 3 names in the list through user input

In [36]:
myList=[]
for i in range(1,4):
    name = input("Enter the names: ")
    myList.append(name)

Enter the names: alex
Enter the names: ram
Enter the names: krish

In [37]:
print(myList)

['alex', 'ram', 'krish']

In [38]:
# map

In [39]:
df

   eid     name salary    Country
0  101     Alex   1000      India
1  102    Krish   3000    Germany
2  103  Salmaan   4000      China
3  104      Ram  10000      Nepal
4  105   Ganesh   5000  Australia

In [40]:
grade = {1000:'A',3000:'A+'}
df['Grade']=df['salary'].map(grade)
df

   eid     name salary    Country Grade
0  101     Alex   1000      India   NaN
1  102    Krish   3000    Germany   NaN
2  103  Salmaan   4000      China   NaN
3  104      Ram  10000      Nepal   NaN
4  105   Ganesh   5000  Australia   NaN

In [41]:
df['salary'].dtypes

dtype('O')

In [42]:
df['salary']=df['salary'].astype(int)

In [43]:
df['salary'].dtypes

dtype('int32')

In [44]:
grade = {1000:'A',3000:'A+'}
df['Grade']=df['salary'].map(grade)
df

   eid     name  salary    Country Grade
0  101     Alex    1000      India     A
1  102    Krish    3000    Germany    A+
2  103  Salmaan    4000      China   NaN
3  104      Ram   10000      Nepal   NaN
4  105   Ganesh    5000  Australia   NaN

In [45]:
grade = {1000:'A',3000:'A+',10000:'E'}
df['Grade']=df['salary'].map(grade)
df

   eid     name  salary    Country Grade
0  101     Alex    1000      India     A
1  102    Krish    3000    Germany    A+
2  103  Salmaan    4000      China   NaN
3  104      Ram   10000      Nepal     E
4  105   Ganesh    5000  Australia   NaN

In [46]:
# replace()

In [52]:
cd = {
    '101':1001,'102':1002
}

In [53]:
df['eid']=df['eid'].replace(cd)

In [54]:
df

    eid     name  salary    Country Grade
0  1001     Alex    1000      India     A
1  1002    Krish    3000    Germany    A+
2   103  Salmaan    4000      China   NaN
3   104      Ram   10000      Nepal     E
4   105   Ganesh    5000  Australia   NaN

In [51]:
df['eid'].dtypes

dtype('O')

In [55]:
import pandas as pd

data = {
    'name':['Alex','Bob','Salmaan','Ram','Bob'],
    'Age':[25,30,25,22,30],
    'Salary':[200,300,400,500,600]
}
df = pd.DataFrame(data)

In [56]:
df

      name  Age  Salary
0     Alex   25     200
1      Bob   30     300
2  Salmaan   25     400
3      Ram   22     500
4      Bob   30     600

In [57]:
df1=df.copy()

In [58]:
df1

      name  Age  Salary
0     Alex   25     200
1      Bob   30     300
2  Salmaan   25     400
3      Ram   22     500
4      Bob   30     600

In [60]:
cd = {
    300:300000
}
df['Salary']=df['Salary'].replace(cd)
df

      name  Age  Salary
0     Alex   25     200
1      Bob   30  300000
2  Salmaan   25     400
3      Ram   22     500
4      Bob   30     600

In [61]:
import pandas as pd

data = {
    'name':['Alex','Bob','Salmaan','Ram','Bob'],
    'Age':[25,30,25,22,30],
    'Salary':[200,300,400,300,600]
}
df2 = pd.DataFrame(data)

In [62]:
cd = {
    300:300000
}
df2['Salary']=df2['Salary'].replace(cd)
df2

      name  Age  Salary
0     Alex   25     200
1      Bob   30  300000
2  Salmaan   25     400
3      Ram   22  300000
4      Bob   30     600

In [65]:
df[df['name']=='Alex'].replace(200,200000)

   name  Age  Salary
0  Alex   25  200000

In [66]:
# Update the Salmaan's age to 30

In [67]:
import pandas as pd

data = {
    'Name':['Alex','Bob','Salmaan','Ram','Bob'],
    'Age':[25,30,25,22,30],
    'Salary':[200,300,400,300,600]
}
df = pd.DataFrame(data)

In [68]:
df

      Name  Age  Salary
0     Alex   25     200
1      Bob   30     300
2  Salmaan   25     400
3      Ram   22     300
4      Bob   30     600

In [70]:
df.loc[df['Name']=='Salmaan','Age']=30

In [71]:
df

      Name  Age  Salary
0     Alex   25     200
1      Bob   30     300
2  Salmaan   30     400
3      Ram   22     300
4      Bob   30     600

In [76]:
df[df['Name']=='Alex'].replace(200,200000)

   Name  Age  Salary
0  Alex   25  200000

In [75]:
df

      Name  Age  Salary
0     Alex   25     200
1      Bob   30     300
2  Salmaan   30     400
3      Ram   22     300
4      Bob   30     600

In [77]:
df

      Name  Age  Salary
0     Alex   25     200
1      Bob   30     300
2  Salmaan   30     400
3      Ram   22     300
4      Bob   30     600

In [90]:
df5=df.copy()

In [82]:
import pandas

In [83]:
print(pandas.__version__)

1.5.3

In [84]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\aryao\anaconda3\lib\site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\aryao\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\aryao\anaconda3\lib\site-packages (from pandas) (2022.7)
Requirement already satisfied: numpy>=1.21.0 in c:\users\aryao\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\aryao\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [96]:
!pip install numpy

Requirement already satisfied: numpy in c:\users\aryao\anaconda3\lib\site-packages (1.24.3)

In [98]:
import numpy
print(numpy.__version__)

1.24.3

In [85]:
print(pandas.__version__)

1.5.3

In [86]:
df.loc[df['Name']=='Salmaan','Age']=4000

In [87]:
df

      Name   Age  Salary
0     Alex    25     200
1      Bob    30     300
2  Salmaan  4000     400
3      Ram    22     300
4      Bob    30     600

In [100]:
# df.loc[df[col_name1]==value1,col_name2]=value2

In [101]:
# Numpy

In [102]:
import pandas

In [103]:
pandas

In [104]:
import numpy
numpy

In [105]:
# Numpy

In [106]:
'''
1. It is the module/library of python.
2. Stands for Numerical Python
3. Numpy arrays are 10x faster than list.
4. It supports n-dimensional arrays.
5. etc
'''

'\n1. It is the module/library of python.\n2. Stands for Numerical Python\n3. Numpy arrays are 10x faster than list.\n4. \n'

In [107]:
mylist=[1,2,3,4]

In [108]:
import numpy as np

In [109]:
# as - alias - nickname

In [111]:
import numpy

arr=numpy.array([10,20,30])

print(arr)

[10 20 30]

In [112]:
import numpy

arr=numpy.array([10,20,30])

print(type(arr))

<class 'numpy.ndarray'>

In [113]:
import numpy

arr=numpy.array([10,20,30])

print(arr)

[10 20 30]

In [115]:
mylist=[10,20,30]
mylist

[10, 20, 30]

In [116]:
# Dimension

In [ ]:
# 0 Dimension

In [117]:
import numpy

arr=numpy.array(20)

print(arr)

20

In [118]:
import numpy

arr=numpy.array(20)

print(arr.ndim)

0

In [119]:
# ndim = check the number dimension

In [120]:
import numpy

arr1=numpy.array(20)
arr2=numpy.array(20)
arr3=numpy.array(20)

print(arr.ndim)

0

In [122]:
import numpy as ria

arr1=ria.array(20)
arr2=ria.array(20)
arr3=ria.array(20)

In [123]:
# 0-D

In [124]:
# 1-D

In [125]:
import numpy

arr=numpy.array([10,20,30,40])

print(arr.ndim)

1

In [126]:
import numpy

arr=numpy.array([10,20,30],[10,20,30])

print(arr.ndim)

TypeError: Field elements must be 2- or 3-tuples, got '10'

In [127]:
# 2D= multiple 1D with one common bracket

In [130]:
import numpy

arr=numpy.array([
    [1,2,3],
    [4,5,6]
])

print(arr.ndim)

2

In [131]:
# 3D

In [133]:
import numpy

arr=numpy.array([[[10,20,30],[10,20,30]],[[10,20,30],[10,20,30]]])

print(arr.ndim)

3

In [ ]:
import numpy

arr=numpy.array([
    [
        [10,20,30],
        [10,20,30]
    ],
    [
        [10,20,30],
        [10,20,30]
    ]
])

print(arr.ndim)

In [142]:
import numpy

arr=numpy.array([[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[[]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]]])

print(arr.ndim)

32

In [143]:
import numpy

arr=numpy.array([10,20,30,40])

print(arr[1])

20

In [145]:
import numpy

arr=numpy.array([
    [1,20,3],
    [4,5,6]
])

print(arr[0,1])

20

In [146]:
import numpy

arr=numpy.array([
    [1,20,3],
    [4,5,6]
])

print(arr[0,2])

3

In [147]:
import numpy

arr=numpy.array([
    [1,20,3],
    [4,5,6]
])

print(arr[0][1])

20

In [148]:
# https://numpy.org/doc/stable/user/absolute_beginners.html